snlkuharlocal/src/Documents/МаркировкаТоваровИСМП/МаркировкаТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркировкаТоваровИСМП</name>
  <comment>Маркировка товаров ИСМП</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.ЛистНабора</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.МаркировкаТоваровИСМП</basedOn>
  <basedOn>Document.КонтрактСПроизводителем</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.ИспользованныеКодыАгрегаций</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ВыданныеКодыАгрегаций</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииИСМП</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПричины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГосКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортерИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращаемыйТоварБылОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКодовSSCC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>фКодыАгрегацийДляПоставщиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>КодАгрегации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументАгрегации</name>
      <type>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробок</name>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.ОтчетКассовойСмены</types>
        <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
        <types>DocumentRef.КонтрактСПроизводителем</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
        <types>DocumentRef.Инвентаризация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.СписаниеТМЦ</types>
        <types>DocumentRef.ЗаданиеНаМаркировку</types>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
        <types>DocumentRef.Машина</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ВидыОперацийМаркировки/ВидыОперацийМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийМаркировки</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>БронированиеАгрегационныхКодов</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки</name>
    <comment>Трансформация упаковки (Добавление, Изъятие)</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК</name>
    <comment>Трансформация АТК (Добавление, Изъятие)</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыДокументовИСМП/ТипыДокументовИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовИСМП</name>
  <enumValues>
    <name>АктУничтожения</name>
    <comment>DESTRUCTION_ACT</comment>
  </enumValues>
  <enumValues>
    <name>КассовыйЧек</name>
    <comment>RECEIPT</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>OTHER</comment>
  </enumValues>
  <enumValues>
    <name>ТаможеннаяДекларация</name>
    <comment>CUSTOMS_DECLARATION</comment>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладная</name>
    <comment>CONSIGNMENT_NOTE</comment>
  </enumValues>
  <enumValues>
    <name>ТоварныйЧек</name>
    <comment>SALES_RECEIPT</comment>
  </enumValues>
  <enumValues>
    <name>УПД</name>
    <comment>UTD</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ТипыУпаковок/ТипыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУпаковок</name>
  <enumValues>
    <name>МаркированныйТовар</name>
  </enumValues>
  <enumValues>
    <name>МонотоварнаяУпаковка</name>
  </enumValues>
  <enumValues>
    <name>МультитоварнаяУпаковка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыКомплектов/ВидыКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКомплектов</name>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Ассортито</name>
  </enumValues>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>ГотовыйКомплект</name>
  </enumValues>
  <enumValues>
    <name>АссортитоКомплектов</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/МаркировкаТоваровИСМП/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы
	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		рПроверки = МожноСоздаватьДокумент();
		Если рПроверки.Успешно Тогда
		Иначе
			Отказ = Истина;
			МаркировкаКС.ВывестиОшибки(рПроверки);
		КонецЕсли; 
	КонецЕсли; 
	
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МаркировкаК.ПроверкаРазрешенияРедактированияУФ(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)	
	Если ИмяСобытия = "ИзмененСтатус" И Источник = Объект.Ссылка  Тогда
		Если НЕ Модифицированность Тогда		
			Прочитать();
			УправлениеВидимостью();
		КонецЕсли;		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//++Данилова Е.В. 19.02.2025 MARK-1454
	Если НЕ Отказ
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.ВводВОборот")
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовМаркировки.ВРаботе")
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		СоздаватьДокументПоГотовымКомплектам = Ложь; 
		ПроверитьДокументНаНаличиеГотовыхКомплектовНаСервере(СоздаватьДокументПоГотовымКомплектам);
		
		Если СоздаватьДокументПоГотовымКомплектам Тогда
			
			Отказ = Истина; 
			//Данилова Е.В. 04.06.2026 без задачи 
			ОповещениеВопросПоСозданиюДокумента = Новый ОписаниеОповещения("ОтветНаВопросСоздатьДокументГотовыйКомплект",ЭтотОбъект);
			//ОповещениеВопросПоСозданиюДокумента = Новый ОписаниеОповещения("ОтветНаВопросСоздатьДокументГотовыйКомплект",ЭтаФорма); 
			ПоказатьВопрос(ОповещениеВопросПоСозданиюДокумента,"Найдены готовые комплекты, выделить их в отдельный документ?",РежимДиалогаВопрос.ОКОтмена); 	
			
		КонецЕсли;
		
	КонецЕсли;   
	//--Данилова Е.В. 19.02.2025
КонецПроцедуры


#КонецОбласти

#Область СобытияЭлементовУправления


&НаКлиенте
Процедура ВидОперацииИСПМ_ПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ТипДокумента_ПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры


#КонецОбласти


&НаСервере
Функция МожноСоздаватьДокумент()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ТипОснования = ТипЗнч(Объект.ДокументОснование);
		Если ТипОснования = Тип("ДокументСсылка.ЛистНабора") Тогда
			АгрегацииПоОснованию = Документы.МаркировкаТоваровИСМП.ПолучитьОперацииПоОснованию(Объект.ДокументОснование, Перечисления.ВидыОперацийМаркировки.Агрегация);					
			Если АгрегацииПоОснованию.Количество() > 0 Тогда				
				Результат.Ошибки.Добавить("Уже сущсевуют подчиненные агрегации к ЛН: " + Объект.ДокументОснование);
			КонецЕсли; 
		КонецЕсли;	
	КонецЕсли;
	
	Результат.Успешно = ( Результат.Ошибки.Количество() = 0 );
	
	Возврат Результат;
КонецФункции //МожноСоздаватьДокумент()

&НаСервере
Процедура УправлениеВидимостью()
	Имена = СтрРазделить("
		|Организация,ПодразделениеНанесения,ДокументОснование,ШтрихкодыУпаковок,Дата,ВидОперации,ВидОперацииИСМП,
		|ТипДокумента,НаименованиеПервичногоДокумента,ОписаниеПричины,ИдентификаторГосКонтракта,Страна,ИмпортерИД,
		|КоличествоКодовSSCC,ТипУпаковки,ТипШК,фКодыАгрегацийДляПоставщиков,ДокументыОснования", ","
	);
	
	Если РольДоступна("Администратор") Тогда
		Элементы.ПодразделениеНанесенияС.Доступность = Истина;
		Если НЕ ТолькоПросмотр Тогда		
			Элементы.кнОчиститьКМ.Доступность = Истина;
		КонецЕсли;		
	Иначе		
		Имена.Добавить("Статус");
		Элементы.АТК.ТолькоПросмотр 		= Истина;
		
		Элементы.гТовары.ТолькоПросмотр		= Истина;
		Элементы.гКоды.ТолькоПросмотр		= Истина;
		Элементы.гКоробки.ТолькоПросмотр	= Истина;
	КонецЕсли;
	
	Элементы.гТовары.Заголовок 	= СтрШаблон("Товары (%1)", 	Формат(Объект.Товары.Количество(), "ЧН=0; ЧРГ=' '; ЧГ=3,0"));
	Элементы.гКоды.Заголовок 	= СтрШаблон("Коды (%1)", 	Формат(Объект.ШтрихкодыУпаковок.Количество(), "ЧН=0; ЧРГ=' '; ЧГ=3,0"));
	Элементы.гКоробки.Заголовок = СтрШаблон("Коробки (%1)", Формат(Объект.ШтрихкодыКоробок.Количество(), "ЧН=0; ЧРГ=' '; ЧГ=3,0"));	
	
	Элементы.КоличествоКодовSSCC.Видимость		= Ложь;
	Элементы.ПодразделениеНанесения.Видимость	= Ложь;
	Элементы.ТипШК.Видимость					= Ложь;
	Элементы.АТК.Видимость						= Ложь;
	
	Элементы.ВидОперацииИСМП.Видимость	= Истина;
	Элементы.ТипДокумента.Видимость 	= Истина;
	Элементы.гкНоменклатура.Видимость	= Истина;	
	
	мТолькоПросмотр = ТолькоПросмотр ИЛИ (Объект.Статус <> Перечисления.СтатусыДокументовМаркировки.ВРаботе);
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация Тогда
		Элементы.ШтрихкодыУпаковокКодАгрегации.Видимость = Истина;		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.АТК Тогда
		Элементы.ШтрихкодыУпаковокКодАгрегации.Видимость = Истина;
		Элементы.ШтрихкодыУпаковокКодАгрегации.ТолькоПросмотр = Истина;		
		Элементы.ВидОперацииИСМП.Видимость	= Ложь;
		Элементы.КоличествоКодовSSCC.Видимость		= Истина;
		Элементы.АТК.Видимость						= Истина;
		Элементы.АТК.ТолькоПросмотр					= Истина;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.ТрансформацияАТК Тогда
		Элементы.АТК.Видимость						= Истина;
		Элементы.АТК.ТолькоПросмотр					= мТолькоПросмотр;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
		Элементы.ШтрихкодыУпаковокКодАгрегации.Видимость	= Истина;
		Элементы.КоличествоКодовSSCC.Видимость				= Истина;
		Элементы.ПодразделениеНанесения.Видимость			= Истина;
		
		Элементы.гкНоменклатура.Видимость	= Ложь;
		Элементы.ВидОперацииИСМП.Видимость	= Ложь;
		Элементы.ТипДокумента.Видимость 	= Ложь;						
	Иначе
		Элементы.ШтрихкодыУпаковокКодАгрегации.Видимость = Ложь;		
	КонецЕсли;
	
	Для Каждого ИмяЭУ Из Имена Цикл
		Элементы[СокрЛП(ИмяЭУ)].ТолькоПросмотр = мТолькоПросмотр;	
	КонецЦикла;	
	
	Элементы.ДобавитьКоды.Доступность				= НЕ мТолькоПросмотр;
	Элементы.УдалитьКоды.Доступность 				= НЕ мТолькоПросмотр;
	Элементы.УдалитьКодыНаборов.Доступность			= НЕ мТолькоПросмотр;
	Элементы.ЗаполнитьРазагрегации.Доступность 		= НЕ мТолькоПросмотр;
	Элементы.ПодразделениеНанесения.ТолькоПросмотр	= мТолькоПросмотр;
	Элементы.ПодразделениеНанесенияС.ТолькоПросмотр	= мТолькоПросмотр;
	
	Элементы.НаименованиеПервичногоДокумента.Видимость	= Ложь;					
	Элементы.ОписаниеПричины.Видимость 					= Ложь;	
	Элементы.ИдентификаторГосКонтракта.Видимость		= Ложь;
	Элементы.гСтрана.Видимость							= Ложь;
	Элементы.ВозвращаемыйТоварБылОплачен.Видимость 		= Ложь;
	Элементы.гкНабор.Видимость							= Ложь;
	Элементы.гКоробки.Видимость							= Ложь;
	Элементы.фКодыАгрегацийДляПоставщиков.Видимость		= Ложь;
	Элементы.гШтрихКодУпаковки.Видимость 				= Ложь;
	Элементы.ИННПокупателя.Видимость					= Ложь;
	
	//ВидОперацииИСМП
	Если Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_Импорт   
		//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522 Добавил ИЛИ 
		ИЛИ Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно
		ИЛИ Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков Тогда		
		Элементы.ТипДокумента.Видимость 	= Ложь;
		Если Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВводВОборот_МаркировкаОстатков 
			//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522 Добавил ИЛИ 
			ИЛИ Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.Перемаркировка_ИспорченоЛибоУтеряно Тогда
			Элементы.ПодразделениеНанесения.Видимость = Истина;		
		КонецЕсли; 
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_БезвозмезднаяПередача Тогда
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
			Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;					
		КонецЕсли; 					
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ВозвратФизическомуЛицу Тогда
		Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ДистанционнаяПродажа Тогда
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
			Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;					
		КонецЕсли;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС Тогда	
		Элементы.ТипДокумента.Видимость = Ложь;
		Элементы.гСтрана.Видимость = Истина;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ИспользованиеДляСобственныхНужд Тогда
		Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;
		Элементы.ИННПокупателя.Видимость = Истина;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Конфискация Тогда
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
			Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;					
		КонецЕсли;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоОбразцам Тогда
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
			Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;					
		КонецЕсли;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоГосударственномуКонтракту Тогда	
		Элементы.ТипДокумента.Видимость					= Ложь;
		Элементы.ИдентификаторГосКонтракта.Видимость	= Истина;						
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной Тогда	
		Элементы.ТипДокумента.Видимость					= Ложь;
		Элементы.ИдентификаторГосКонтракта.Видимость	= Истина;						
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Уничтожение Тогда
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
			Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;					
		КонецЕсли;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утилизация Тогда
		Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Утрата Тогда
		Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_Прочее Тогда
		Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС Тогда
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
			Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;					
		КонецЕсли;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки Тогда				
		Элементы.ВидОперацииИСМП.Видимость	= Ложь;		
		//Элементы.гкНоменклатура.Видимость	= Ложь;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_РозничнаяРеализация Тогда
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
			Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;					
		КонецЕсли;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи Тогда
		Если Объект.ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
			Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;					
		КонецЕсли;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ВозвратВОборот_Возврат_ДистанционнаяПродажа Тогда
		Элементы.ВозвращаемыйТоварБылОплачен.Видимость = Истина;
		
		Если Объект.ВозвращаемыйТоварБылОплачен Тогда
			Если Объект.ТипДокумента = Перечисления.ТипыДокументовИСМП.Прочее Тогда
				Элементы.НаименованиеПервичногоДокумента.Видимость = Истина;					
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Объект.ВидОперацииИСМП = Перечисления.ВидыОперацийИСМП.ФормированиеНабора Тогда
		Элементы.гкНабор.Видимость		= Истина;
		Элементы.ТипДокумента.Видимость	= Ложь;	
	Иначе
		Элементы.ТипДокумента.Видимость		= Ложь;		
	КонецЕсли;	
	
	Элементы.ТипУпаковки.Доступность 		= Ложь;
	Элементы.гКодыSSCC.Видимость 			= Ложь;
	Элементы.гкАгрегация.Видимость			= Ложь;
	Элементы.гкБронированиеSSCC.Видимость	= Ложь;
	
	//ВидОперации
	Если Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация Тогда
		Элементы.ТипУпаковки.Доступность	= Истина;
		Элементы.гКоробки.Видимость			= Истина;
		Элементы.ТипШК.Видимость			= Истина;
		
		Элементы.гкАгрегация.Видимость		= Истина;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
		Элементы.гКодыSSCC.Видимость 		= Истина;
		Элементы.ТипУпаковки.Доступность	= Истина;
		Элементы.ТипШК.Видимость			= Истина;
		Элементы.фКодыАгрегацийДляПоставщиков.Видимость = Истина;
		
		Элементы.гкБронированиеSSCC.Видимость = Истина;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки Тогда		
		Элементы.ТипУпаковки.Доступность	= Истина;
		Элементы.ТипДокумента.Видимость		= Ложь;		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.ТрансформацияУпаковки Тогда
		Элементы.гШтрихКодУпаковки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперации_ПриИзменении(Элемент)
	//Данилова Е.В. 04.06.2026 (без задачи) изменено обращение к перечислениям
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.ОтгрузкаВЕАЭС") Тогда // Перечисления.ВидыОперацийМаркировки.ОтгрузкаВЕАЭС Тогда
		Объект.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.ОтгрузкаВЕАЭС"); //Перечисления.ВидыОперацийИСМП.ОтгрузкаВЕАЭС;		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.РасформированиеУпаковки") Тогда //Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки Тогда
		
		Объект.ВидОперацииИСМП = ПредопределенноеЗначение("Перечисление.ВидыОперацийИСМП.РасформированиеУпаковки"); //Перечисления.ВидыОперацийИСМП.РасформированиеУпаковки;
		
		Объект.Товары.Очистить();
		Объект.ШтрихкодыКоробок.Очистить();
		Объект.ШтрихкодыУпаковок.Очистить();
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов")Тогда //Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
		Если Объект.ПодразделениеНанесения = Неопределено Тогда
			//++Данилова Е.В. 04.06.2026 Наряд 0000000256
			//Объект.ПодразделениеНанесения = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();

			Если Не ЗначениеЗаполнено(Объект.ДокументОснование) И ОбщегоНазначения_ПИ.ЭтоУзел_ЦО() Тогда
				ТипУзла = ПредопределенноеЗначение("Перечисление.ТипУзлаИБ.Склад");
				МассивУзлов = Маркировка_ПИ.ПолучитьМассивУзловПоТипу(ТипУзла);
				Если МассивУзлов.Количество() > 0 Тогда
					Объект.ПодразделениеНанесения = Маркировка_ПИ.ПодразделениеПоУзлу(МассивУзлов[0]);
				КонецЕсли;
			Иначе
				Объект.ПодразделениеНанесения = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();
			КонецЕсли;
				//--Данилова Е.В. 04.06.2026 
		КонецЕсли;
		
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.КонтрактСПроизводителем") Тогда
			Объект.фКодыАгрегацийДляПоставщиков = Истина;
			//Данилова Е.В. 04.06.2026 (без задачи)											
			//Объект.ПодразделениеНанесения = ПолучитьРеквизитШапки(Объект.ДокументОснование, "Контрагент");
			Объект.ПодразделениеНанесения = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(Объект.ДокументОснование, "Контрагент");
		КонецЕсли;		
		
		//++Данилова Е.В. 20.02.2025 MARK-1454
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.АТК") //Перечисления.ВидыОперацийМаркировки.АТК 
		И Объект.Товары.Количество() > 0 Тогда
		ОповещениеВопрос = Новый ОписаниеОповещения("ПослеИзмененияВидаОперации",ЭтотОбъект); //ЭтаФорма); 
		//++Данилова Е.В. 25.06.2025 MARK-2484 
		//ПоказатьВопрос(ОповещениеВопрос,"Из документа будут исключены готовые наборы и его комплектующие!",РежимДиалогаВопрос.ОКОтмена); 
		ПоказатьВопрос(ОповещениеВопрос,"Из документа будут исключены комплектующие готовых наборов и спаек!",РежимДиалогаВопрос.ОКОтмена);
		//--Данилова Е.В. 25.06.2025
		//--Данилова Е.В. 20.02.2025
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.Списание") Тогда //Перечисления.ВидыОперацийМаркировки.Списание Тогда
		//+++Чирков 17.10.2025 MARK-3106
		Если Объект.ПодразделениеНанесения.Пустая() Тогда		
			Объект.ПодразделениеНанесения = ОбщегоНазначения_ПИ.ПолучитьПодразделениеТекущегоУзла();					
		КонецЕсли;		
		//---Чирков 17.10.2025
	КонецЕсли;
	
	ПроверитьУзменитьТипУпаковки();
	
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУзменитьТипУпаковки()
	//Данилова Е.В. 04.06.2026 (без задачи) изменено обращение к перечислениям
	НовыйТипУпаковки = ПредопределенноеЗначение("Перечисление.ТипыУпаковок.МаркированныйТовар"); //Перечисления.ТипыУпаковок.МаркированныйТовар;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.Агрегация") Тогда //Перечисления.ВидыОперацийМаркировки.Агрегация Тогда
		НовыйТипУпаковки = Неопределено;		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов") Тогда //Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда
		НовыйТипУпаковки = Неопределено;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийМаркировки.РасформированиеУпаковки") Тогда //Перечисления.ВидыОперацийМаркировки.РасформированиеУпаковки Тогда
		НовыйТипУпаковки = Неопределено;		
	КонецЕсли;
	
	Если Объект.ТипУпаковки <> НовыйТипУпаковки Тогда
		Объект.ТипУпаковки = НовыйТипУпаковки;	
	КонецЕсли; 
КонецПроцедуры
 
&НаКлиенте
Процедура ШтрихкодыУпаковок_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВыбраннаяСтрока<>Неопределено Тогда 
		ТекСтрока = Объект.ШтрихкодыУпаковок.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если Поле.Имя = "ШтрихкодыУпаковокШтрихкодУпаковки" Тогда		
			ПоказатьЗначение( , ТекСтрока.ШтрихкодУпаковки);
		ИначеЕсли Поле.Имя = "ШтрихкодыУпаковокШтрихкодНабора" Тогда
			ПоказатьЗначение( , ТекСтрока.ШтрихкодНабора);
		ИначеЕсли СтрНачинаетсяС(Поле.Имя, "ШтрихкодыУпаковокКодАгрегации") Тогда
			КодКоробки = НайтиКодМаркировки(ТекСтрока.КодАгрегации);
			Если ЗначениеЗаполнено(КодКоробки) Тогда
				ПоказатьЗначение( , КодКоробки);
			Иначе				
				ПоказатьЗначение( , ТекСтрока.ШтрихкодНабора);				
			КонецЕсли;			
		ИначеЕсли Поле.Имя = "ШтрихкодыУпаковокШтрихкодУпаковкиВладелец" Тогда
			ПоказатьЗначение( , МаркировкаВС.ПолучитьРеквизитШапки_(ТекСтрока.ШтрихкодУпаковки, "Владелец"));			
		КонецЕсли;			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда) 
	//Данилова Е.В. 04.06.2026 (без задачи) изменено обращение к перечислениям
	//Валетов + 14,10,2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-7461
	//Если НЕ ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	Если НЕ ТипУзла_УправляющееПодразделение() Тогда 
		Перезаполнить_НаСервере();   
	КонецЕсли;  
	//Валетов -
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипУзла_УправляющееПодразделение()
	Возврат ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение; 
КонецФункции

&НаСервере
Процедура Перезаполнить_НаСервере()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.Заполнить(ДокОбъект.ДокументОснование);
	
	ЗначениеВДанныеФормы(ДокОбъект.Товары, 				Объект.Товары);
	ЗначениеВДанныеФормы(ДокОбъект.ШтрихкодыУпаковок,	Объект.ШтрихкодыУпаковок);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКоды(Команда)
	ДобавитьКоды_НаСервере(ВвестиКоды());
КонецПроцедуры

&НаСервере
Процедура ДобавитьКоды_НаСервере(Коды)
	Для Каждого ШтрихкодУпаковки Из Коды Цикл
		СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();							
		СтрокаТЧ.ШтрихкодУпаковки = ШтрихкодУпаковки;			
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКоды(Команда)
	УдалитьКоды_НаСервере(ВвестиКоды());
КонецПроцедуры

&НаСервере           
Процедура УдалитьКоды_НаСервере(Коды)
	Для Каждого ШтрихкодУпаковки Из Коды Цикл
		Строки = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", ШтрихкодУпаковки));
		Для Каждого Строка Из Строки Цикл
			Объект.ШтрихкодыУпаковок.Удалить(Строка);		
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура УдалитьКодыНаборов(Команда)
	Для Каждого ШтрихкодНабора Из ВвестиКоды() Цикл
		Строки = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодНабора", ШтрихкодНабора));
		Для Каждого Строка Из Строки Цикл
			Объект.ШтрихкодыУпаковок.Удалить(Строка);		
		КонецЦикла;
	КонецЦикла; 	
КонецПроцедуры

&НаКлиенте
Функция ВвестиКоды()
	мКоды = Новый Массив;
	СтрокаКодов = "";
	Если ВвестиСтроку(СтрокаКодов, "Введите коды маркировки", , Истина) Тогда
		Для Каждого Строка Из СтрРазделить(СтрокаКодов, Символы.ПС) Цикл
			Строка = СтрЗаменить(Строка,"(01)","");		
			Строка = СтрЗаменить(Строка,"(21)","");		
			Строка = СтрЗаменить(Строка," ","");		
			//Данилова Е.В. 04.06.2026 (без задачи)
			//ШтрихкодУпаковки = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(Строка, Истина);
			ШтрихкодУпаковки = НайтиКодМаркировки(Строка); 
			Если НЕ ШтрихкодУпаковки.Пустая() Тогда
				мКоды.Добавить(ШтрихкодУпаковки.Ссылка);				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Возврат мКоды;
КонецФункции // ()

&НаСервереБезКонтекста
Функция НайтиКодМаркировки(СтрокаКМ)
	Возврат Справочники.ШтрихкодыУпаковокТоваров.НайтиПоНаименованию(СтрокаКМ, Истина);
КонецФункции // ()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.БронированиеАгрегационныхКодов Тогда 
		Если Объект.Товары.Количество() > 0 Тогда	
			Объект.Товары.Очистить();
		КонецЕсли;
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийМаркировки.Агрегация Тогда
		КривыхСтрок = 0;
		
		Для Каждого СтрокаТЧ Из Объект.ШтрихкодыУпаковок Цикл			
			Если НЕ (
				ЗначениеЗаполнено(СтрокаТЧ.КодАгрегации) 
				ИЛИ ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодКоробки)
				ИЛИ ЗначениеЗаполнено(СтрокаТЧ.ШтрихкодНабора) 
				) Тогда
				КривыхСтрок = КривыхСтрок + 1;							
			КонецЕсли;		
		КонецЦикла; 
		
		Если КривыхСтрок > 0 Тогда
			Сообщить(СтрШаблон("Не заполнены коды агрегации в %1 строках.", КривыхСтрок), СтатусСообщения.ОченьВажное);
			Отказ = Истина;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВозвращаемыйТоварБылОплачен_ПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры
 
&НаКлиенте
Процедура ЗаполнитьРазагрегации(Команда)
	ТипОснования = ТипЗнч(Объект.ДокументОснование);
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И ТипОснования = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		рПолучения = ПолучитьРазАгрегации_НаСервере(Объект.ДокументОснование);
		Если рПолучения.Успешно Тогда
			Объект.ШтрихкодыУпаковок.Очистить();
			Для Каждого ШтрихкодУпаковки Из рПолучения.Данные Цикл
				СтрокаТЧ = Объект.ШтрихкодыУпаковок.Добавить();
				СтрокаТЧ.ШтрихкодУпаковки = ШтрихкодУпаковки;				
			КонецЦикла;
			Если рПолучения.Данные.Количество() = 0 Тогда
				Сообщить("Не обнаружено агрегационных кодов для расформирования.", СтатусСообщения.Обычное);			
			КонецЕсли; 
		Иначе
			МаркировкаКС.ВывестиОшибки(рПолучения);
		КонецЕсли; 
	Иначе
		Сообщить("Недопустимый тип основания: " + ТипОснования);
	КонецЕсли; 	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРазАгрегации_НаСервере(РНК)
	Возврат Документы.МаркировкаТоваровИСМП.ПолучитьДанныеРазАгрегации(РНК);	
КонецФункции

//++Данилова Е.В. 19.02.2025 MARK-1454

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ПроверитьДокументНаНаличиеГотовыхКомплектовНаСервере(СоздаватьДокументПоГотовымКомплектам)

	ОбъектДок = РеквизитФормыВЗначение("Объект"); 
	СтруктураДанныхПоТоварам = ОбъектДок.ПроверитьГотовыеКомплектыВДокументе(Объект.Товары.Выгрузить()); 
	Если СтруктураДанныхПоТоварам.ГотовыеКомплекты  
		И СтруктураДанныхПоТоварам.НеГотовыеКомплекты Тогда   		
		
		СоздаватьДокументПоГотовымКомплектам = Истина; 
		
	КонецЕсли;
КонецПроцедуры // ПроверитьДокументНаНаличиеГотовыхКомплектовНаСервере()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ОтветНаВопросСоздатьДокументГотовыйКомплект(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 

	Если ОтветНаВопрос = КодВозвратаДиалога.ОК Тогда
		
		
		ДокументПоКомплектам = СоздатьДокументГотовыйКомплектНаСервере();
		 
		Если Не ЗначениеЗаполнено(ДокументПоКомплектам) Тогда
			
			Возврат; 	
			
		КонецЕсли;
		
		Записать();
		
		ОткрытьЗначение(ДокументПоКомплектам);	
		
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоздатьДокументГотовыйКомплектНаСервере()
	
	ПараметрыЗаполнения = Новый Структура("ПодразделениеНанесения,Организация,ДокументОснование,ВидОперации,ВидОперацииИСМП"); 
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения,Объект); 	
	
	ТЧТовары 		= Объект.Товары.Выгрузить(); 
	ТЧШтрихКоды 	= Объект.ШтрихкодыУпаковок.Выгрузить(); 
	
	ДокОбъект = РеквизитФормыВЗначение("Объект"); 
	
	НовыйДокумент = ДокОбъект.СоздатьНовыйДокументМаркировкиПоГотовымКомплектам(ТЧТовары,ТЧШтрихКоды,ПараметрыЗаполнения);  
	
	Если Не ЗначениеЗаполнено(НовыйДокумент) Тогда
		
		Возврат неопределено; 	
		
	КонецЕсли;
	
	//////////////////////////////////////////////////
	/////////////////////////////////////////////////
	Для каждого СтрокаТоваров Из  НовыйДокумент.Товары Цикл
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура)); 
		Если  НайденныеСтроки.Количество()> 0 Тогда
			
			Объект.Товары.Удалить(НайденныеСтроки[0]); 
			
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаШК Из  НовыйДокумент.ШтрихкодыУпаковок Цикл
		
		НайденныеСтроки = Объект.ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки",СтрокаШК.ШтрихкодУпаковки)); 
		Если  НайденныеСтроки.Количество()> 0 Тогда
			
			Объект.ШтрихкодыУпаковок.Удалить(НайденныеСтроки[0]); 
			
		КонецЕсли;
	КонецЦикла;

	
	Возврат НовыйДокумент.ссылка; 
	
 КонецФункции
 
  //--Данилова Е.В. 19.02.2025
  
  //++Данилова Е.В. 20.02.2025   MARK-1454
  
  &НаКлиенте
Процедура ПослеИзмененияВидаОперации(ОтветНаВопрос,ДополнительныеПараметры) Экспорт 
  
	Если ОтветНаВопрос = КодВозвратаДиалога.ОК Тогда
		
		ПерезаполнитьТаблицыБезУчетаГотовыхНаборов(); 
		
		ПроверитьУзменитьТипУпаковки();
		
		УправлениеВидимостью();
	КонецЕсли;
  
КонецПроцедуры // ПослеИзмененияВидаОперации()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ПерезаполнитьТаблицыБезУчетаГотовыхНаборов()
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Количество КАК Количество,
	               |	ВТТовары.Цена КАК Цена
	               |ПОМЕСТИТЬ ВтТовары
	               |ИЗ
	               |	&Товары КАК ВТТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ВТШтрихкодыУпаковок.ШтрихкодУпаковки КАК Справочник.ШтрихкодыУпаковокТоваров) КАК ШтрихкодУпаковки,
	               |	ВТШтрихкодыУпаковок.КодАгрегации КАК КодАгрегации,
	               |	ВТШтрихкодыУпаковок.ДокументОснование КАК ДокументОснование,
	               |	ВТШтрихкодыУпаковок.ШтрихкодНабора КАК ШтрихкодНабора,
	               |	ВТШтрихкодыУпаковок.ШтрихкодКоробки КАК ШтрихкодКоробки,
	               |	ВТШтрихкодыУпаковок.ДокументАгрегации КАК ДокументАгрегации
	               |ПОМЕСТИТЬ ВтШКУпаковки
	               |ИЗ
	               |	&ШтрихкодыУпаковок КАК ВТШтрихкодыУпаковок
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТовары.Номенклатура КАК Номенклатура,
	               |	ВТТовары.Цена КАК Цена,
	               |	ВТТовары.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТТоварыБезГН
	               |ИЗ
	               |	ВтТовары КАК ВТТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправ
	               |		ПО ВТТовары.Номенклатура = НоменклатураСправ.Ссылка
	               |			И (НоменклатураСправ.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующие
	               |		ПО (НоменклатураКоплектующие.Номенклатура = ВТТовары.Номенклатура)
	               |			И (НоменклатураКоплектующие.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.ГотовыйКомплект))
				   //++Данилова Е.В. 25.06.2025  MARK-2355
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправСпайки
	               |		ПО ВТТовары.Номенклатура = НоменклатураСправСпайки.Ссылка
	               |			И (НоменклатураСправСпайки.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.Коплектующие КАК НоменклатураКоплектующиеСпайки
	               |		ПО (НоменклатураКоплектующиеСпайки.Номенклатура = ВТТовары.Номенклатура)
	               |			И (НоменклатураКоплектующиеСпайки.Ссылка.ВидКомплекта = ЗНАЧЕНИЕ(Перечисление.ВидыКомплектов.Комплект))

				   //--Данилова Е.В. 25.06.2025
	               |ГДЕ 
				   //++Данилова Е.В. 25.06.2025 MARK-2355, MARK-2484  
	               //|	НоменклатураСправ.Ссылка ЕСТЬ NULL
				   |	НоменклатураКоплектующиеСпайки.Ссылка ЕСТЬ NULL 
				   //--Данилова Е.В. 25.06.2025
	               |	И НоменклатураКоплектующие.Ссылка ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТоварыБезГН.Номенклатура КАК Номенклатура,
	               |	ВТТоварыБезГН.Цена КАК Цена,
	               |	ВТТоварыБезГН.Количество КАК Количество
	               |ИЗ
	               |	ВТТоварыБезГН КАК ВТТоварыБезГН
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВтШКУпаковки.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	               |	ВтШКУпаковки.КодАгрегации КАК КодАгрегации,
	               |	ВтШКУпаковки.ДокументОснование КАК ДокументОснование,
	               |	ВтШКУпаковки.ШтрихкодНабора КАК ШтрихкодНабора,
	               |	ВтШКУпаковки.ШтрихкодКоробки КАК ШтрихкодКоробки,
	               |	ВтШКУпаковки.ДокументАгрегации КАК ДокументАгрегации
	               |ИЗ
	               |	ВтШКУпаковки КАК ВтШКУпаковки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыБезГН КАК ВтТовары
	               |		ПО ВтШКУпаковки.ШтрихкодУпаковки.Владелец = ВтТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Товары",Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("ШтрихкодыУпаковок",Объект.ШтрихкодыУпаковок.Выгрузить());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	Объект.Товары.Загрузить(ПакетЗапросов[3].Выгрузить()); 
	Объект.ШтрихкодыУпаковок.Загрузить(ПакетЗапросов[4].Выгрузить()); 
	
КонецПроцедуры // ()

&НаСервере
Процедура ДополнитьКодыНаСервере(ЧислоКодов)
	ТипШК=Объект.ТипШК;
	ТипУпаковки=Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
	ДопПараметры = Новый Структура("Добавлять", Истина);
	
	рБронирования = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьЗабронироватьСвободныеКодыАгрегации(ТипШК,
	ТипУпаковки,ЧислоКодов,объект.Ссылка,ДопПараметры);
	если рБронирования.Успешно тогда
		
		Для каждого СтрМасс из рБронирования.Данные цикл
			СтрТЧ=объект.ШтрихкодыКоробок.Добавить();
			СтрТЧ.ДатаДобавления=ТекущаяДата();
			СтрТЧ.ШтрихкодКоробки=СтрМасс;
		КонецЦикла;			
		Попытка
			Записать();
		Исключение
			Сообщить("Не удалось записать документ: " + ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьКоды(Команда)
	ЧислоКодов=0;
	ВвестиЧисло(ЧислоКодов,"Введите число заказываемых кодов");
	ДополнитьКодыНаСервере(ЧислоКодов);
КонецПроцедуры

//--Данилова Е.В. 20.02.2025

&НаКлиенте
Процедура ОчиститьКМ(Команда)
	ОчиститьКМ_НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьКМ_НаСервере()
	Объект.ШтрихкодыУпаковок.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры
